<template>
  <UPageSection
    orientation="horizontal"
    title="Философия обучения"
    reverse
    :ui="{
      container: 'gap-8 lg:gap-12 !pt-0',
      title: 'text-left text-xl sm:text-2xl lg:text-3xl font-medium',
      description: 'text-left mt-4 text-sm sm:text-base text-muted'
    }"
  >
    <template #description>
      <p>
        Ко мне приходят не только за техникой. Ко мне приходят, чтобы услышать себя. Чтобы наконец-то спеть ту самую песню, которая годами звучала только в наушниках.
      </p>
      <br>
      <p>
        Я прошла большой путь. И когда-то сама боялась звучать «недостаточно хорошо». Именно поэтому сейчас я создаю безопасное пространство, где можно ошибаться, пробовать новое и не бояться быть собой. «Опора» — это не только про мышцы, но и про психологическую поддержку.
      </p>
      <br>
      <p>
        За много лет работы я поняла главное: волшебство начинается не с упражнений, а с доверия. К себе, к своему телу, к своему дыханию. Мои ученики открывают в себе новые грани и поют то, что никогда не пробовали или даже боялись подумать, а также находят свой стиль и открывают свой природный тембр и индивидуальность.
      </p>
    </template>

    <img
      src="/images/tilda/why/philosophy.jpg"
      width="600"
      height="450"
      alt="Философия обучения в Elementaryvocal"
      class="w-full rounded-lg object-cover"
      loading="lazy"
    >
  </UPageSection>
</template>
